000_РОЗНИЦА_ЦЕНТР/src/Reports/ЖелтыйОтчет/ЖелтыйОтчет.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>ЖелтыйОтчет</name>
  <comment>Продажи-остатки-скидки за период</comment>
  <attributes>
    <name>НачалоПериода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КонецПериода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Магазин</name>
    <type>
      <types>CatalogRef.Магазины</types>
    </type>
  </attributes>
</mdclass:Report>

000_РОЗНИЦА_ЦЕНТР/src/AccumulationRegisters/Продажи/Продажи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Продажи</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Стоимость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СтоимостьБезСкидок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>НДС</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаОкругления</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаБонусныхБалловНачислено</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаБонусныхБалловСписано</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>АналитикаХозяйственнойОперации</name>
    <type>
      <types>CatalogRef.АналитикаХозяйственныхОпераций</types>
    </type>
  </attributes>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДокументПродажи</name>
    <type>
      <types>DocumentRef.РеализацияТоваров</types>
      <types>DocumentRef.ЧекККМ</types>
      <types>DocumentRef.ОтчетОРозничныхПродажах</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Продавец</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </dimensions>
  <dimensions>
    <name>УслугаБанка</name>
    <type>
      <types>CatalogRef.УслугиБанка</types>
    </type>
  </dimensions>
  <dimensions>
    <name>УслугаБанкаПериодПредоставления</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Маржинальность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

000_РОЗНИЦА_ЦЕНТР/src/AccumulationRegisters/ТоварыНаСкладах/ТоварыНаСкладах.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ТоварыНаСкладах</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>АналитикаХозяйственнойОперации</name>
    <type>
      <types>CatalogRef.АналитикаХозяйственныхОпераций</types>
    </type>
  </attributes>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

000_РОЗНИЦА_ЦЕНТР/src/InformationRegisters/ДействующиеЦеныНоменклатуры/ДействующиеЦеныНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ДействующиеЦеныНоменклатуры</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Цена</name>
    <comment>Розничная цена</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Упаковка</name>
    <type>
      <types>CatalogRef.УпаковкиНоменклатуры</types>
    </type>
  </resources>
  <resources>
    <name>Акция</name>
    <comment>Признак акционной цены</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>ВремяИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <dimensions>
    <name>ОбъектЦенообразования</name>
    <type>
      <types>CatalogRef.Магазины</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

000_РОЗНИЦА_ЦЕНТР/src/Reports/ЖелтыйОтчет/Forms/ФормаОтчета/Module.bsl
&НаСервере
Процедура СформироватьОтчетНаСервере()
	
	ТД.Очистить();
	  
	ТекОтчет = РеквизитФормыВЗначение("Отчет");
	Макет = ТекОтчет.ПолучитьМакет("Макет");
	
	// получение областей макета
	ОбластьЗаголовок = Макет.ПолучитьОбласть("ЗаголовокОтчета");
	ОбластьЗаголовок.Параметры.НачалоПериода = Формат(Отчет.НачалоПериода,"ДЛФ=D");
	ОбластьЗаголовок.Параметры.КонецПериода = Формат(Отчет.КонецПериода,"ДЛФ=D");
	
	ОбластьДатаОтчета = Макет.ПолучитьОбласть("ДатаОтчета");
	ОбластьДатаОтчета.Параметры.ТекущаяДата = Формат(ТекущаяДата(),"ДЛФ=DDT");
	
	ОбластьДанные = Макет.ПолучитьОбласть("Данные");
	ОбластьДанные.Параметры.КонецПериода = Формат(Отчет.КонецПериода,"ДЛФ=D");
	
	//общие описания параметров
	Если НЕ (ЗначениеЗаполнено(Отчет.НачалоПериода)) Тогда
		Отчет.НачалоПериода = Дата(1,1,1,0,0,0);
	Иначе Отчет.НачалоПериода = НачалоДня(Отчет.НачалоПериода);
	КонецЕсли;
	
	Если НЕ (ЗначениеЗаполнено(Отчет.КонецПериода)) Тогда
		Отчет.КонецПериода = Дата("39991231");
	Иначе Отчет.КонецПериода = НачалоДня(Отчет.КонецПериода);
	КонецЕсли;
	
	ДП 		= Справочники.Номенклатура.НайтиПоКоду("ДП         ");
	Питание = Справочники.Номенклатура.НайтиПоКоду("ПИТАНИЕ    ");
	Гигиена = Справочники.Номенклатура.НайтиПоКоду("ГИГИЕНА    ");
	Одежда 	= Справочники.Номенклатура.НайтиПоКоду("ОДЕЖДА     ");
	Обувь 	= Справочники.Номенклатура.НайтиПоКоду("ОБУВЬ      ");
	Игрушки = Справочники.Номенклатура.НайтиПоКоду("ИГРУШКИ    ");
	Услуги 	= Справочники.Номенклатура.НайтиПоКоду("УСЛУГИ     ");
	Мебель 	= Справочники.Номенклатура.НайтиПоКоду("МЕБЕЛЬ     ");
	Вибель 	= Справочники.Номенклатура.НайтиПоКоду("ВИБЕЛЬ     ");
	
	ВСЕГОПродажи = 0;
	ВСЕГОСкидки = 0;
	ВСЕГООстатки = 0;

	// установка параметров запроса по данным
	Запрос = Новый Запрос;
	
	Если ЗначениеЗаполнено(Отчет.Магазин) Тогда
	     Запрос.УстановитьПараметр("Склад",	Отчет.Магазин.СкладПродажи);
	Иначе
	     Запрос.УстановитьПараметр("Склад",	Справочники.Склады.ПустаяСсылка());
	КонецЕсли;
	
	Запрос.УстановитьПараметр("НачалоПериода", 	Отчет.НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода", 	Отчет.КонецПериода);
	
	Запрос.УстановитьПараметр("ДП", 			ДП);
	Запрос.УстановитьПараметр("Питание", 		Питание);
	Запрос.УстановитьПараметр("Гигиена", 		Гигиена);
	Запрос.УстановитьПараметр("Одежда", 		Одежда);
	Запрос.УстановитьПараметр("Обувь", 			Обувь);
	Запрос.УстановитьПараметр("Игрушки", 		Игрушки);
	Запрос.УстановитьПараметр("Услуги", 		Услуги);
	Запрос.УстановитьПараметр("Мебель", 		Мебель);
	Запрос.УстановитьПараметр("Вибель", 		Вибель);
		
	// запросы на получение данных
	// ДП
	Запрос.Текст = "ВЫБРАТЬ
                   |    ЕСТЬNULL(СУММА(ПродажиОборотыДП.СтоимостьОборот), 0) КАК СтоимостьОборот,
                   |    ЕСТЬNULL(СУММА(ПродажиОборотыДП.СтоимостьБезСкидокОборот), 0) КАК СтоимостьБезСкидокОборот,
                   |    ЕСТЬNULL(СУММА(ПродажиОборотыДП.СтоимостьБезСкидокОборот - ПродажиОборотыДП.СтоимостьОборот), 0) КАК СуммаСкидок
                   |ИЗ
                   |    РегистрНакопления.Продажи.Обороты(
                   |            &НачалоПериода,
                   |            &КонецПериода,
                   |            ,
                   |            Склад В ИЕРАРХИИ (&Склад)
                   |                И Номенклатура.Ссылка В ИЕРАРХИИ (&ДП)) КАК ПродажиОборотыДП
                   |;
                   |
                   |////////////////////////////////////////////////////////////////////////////////
                   |ВЫБРАТЬ
                   |    ЕСТЬNULL(СУММА(ТоварыНаСкладахОстаткиИОбороты.КоличествоКонечныйОстаток), 0) КАК КонечныйОстаток,
                   |    ЕСТЬNULL(СРЕДНЕЕ(ЦеныНоменклатурыСрезПоследних.Цена), 0) КАК Цена,
                   |    ЕСТЬNULL(СУММА(ТоварыНаСкладахОстаткиИОбороты.КоличествоКонечныйОстаток * ЦеныНоменклатурыСрезПоследних.Цена), 0) КАК СтоимостьОстатков
                   |ИЗ
                   |    РегистрНакопления.ТоварыНаСкладах.ОстаткиИОбороты(
                   |            &НачалоПериода,
                   |            &КонецПериода,
                   |            ,
                   |            ,
                   |            Склад В ИЕРАРХИИ (&Склад)
                   |                И Номенклатура.Ссылка В ИЕРАРХИИ (&ДП)) КАК ТоварыНаСкладахОстаткиИОбороты
                   |        ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДействующиеЦеныНоменклатуры.СрезПоследних КАК ЦеныНоменклатурыСрезПоследних
                   |        ПО ТоварыНаСкладахОстаткиИОбороты.Номенклатура = ЦеныНоменклатурыСрезПоследних.Номенклатура";
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	ВыборкаДанныхПродажи = РезультатЗапроса[0].Выгрузить();
	ВыборкаДанныхОстатки = РезультатЗапроса[1].Выгрузить();

	ОбластьДанные.Параметры.ДППродажи = ВыборкаДанныхПродажи[0].СтоимостьОборот;
	ОбластьДанные.Параметры.ДПСкидка = ВыборкаДанныхПродажи[0].СуммаСкидок;
	ОбластьДанные.Параметры.ДПОстаток = ВыборкаДанныхОстатки[0].СтоимостьОстатков;
	
	ВСЕГОПродажи = ВСЕГОПродажи + ОбластьДанные.Параметры.ДППродажи;
	ВСЕГОСкидки = ВСЕГОСкидки + ОбластьДанные.Параметры.ДПСкидка;
	ВСЕГООстатки = ВСЕГООстатки + ОбластьДанные.Параметры.ДПОстаток;

	// Питание
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЕСТЬNULL(СУММА(ПродажиОборотыПитание.СтоимостьОборот), 0) КАК СтоимостьОборот,
	               |	ЕСТЬNULL(СУММА(ПродажиОборотыПитание.СтоимостьБезСкидокОборот), 0) КАК СтоимостьБезСкидокОборот,
	               |	ЕСТЬNULL(СУММА(ПродажиОборотыПитание.СтоимостьБезСкидокОборот - ПродажиОборотыПитание.СтоимостьОборот), 0) КАК СуммаСкидок
	               |ИЗ
	               |	РегистрНакопления.Продажи.Обороты(
	               |			&НачалоПериода,
	               |			&КонецПериода,
	               |			,
	               |			Склад В ИЕРАРХИИ (&Склад)
	               |				И Номенклатура.Ссылка В ИЕРАРХИИ (&Питание)) КАК ПродажиОборотыПитание
	               |;
	               |
				   |////////////////////////////////////////////////////////////////////////////////
				   |ВЫБРАТЬ
				   |	ЕСТЬNULL(СУММА(ТоварыНаСкладахОстаткиИОбороты.КоличествоКонечныйОстаток),0) КАК КонечныйОстаток,
				   |	ЕСТЬNULL(СРЕДНЕЕ(ЦеныНоменклатурыСрезПоследних.Цена),0) КАК Цена,
                   |    ЕСТЬNULL(СУММА(ТоварыНаСкладахОстаткиИОбороты.КоличествоКонечныйОстаток * ЦеныНоменклатурыСрезПоследних.Цена), 0) КАК СтоимостьОстатков
				   |ИЗ
				   |	РегистрНакопления.ТоварыНаСкладах.ОстаткиИОбороты(
				   |			&НачалоПериода,
				   |			&КонецПериода,
				   |			,
				   |			,
				   |			Склад В ИЕРАРХИИ (&Склад)
				   |				И Номенклатура.Ссылка В ИЕРАРХИИ (&Питание)) КАК ТоварыНаСкладахОстаткиИОбороты
				   |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДействующиеЦеныНоменклатуры.СрезПоследних КАК ЦеныНоменклатурыСрезПоследних
				   |		ПО ТоварыНаСкладахОстаткиИОбороты.Номенклатура = ЦеныНоменклатурыСрезПоследних.Номенклатура";
				   
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	ВыборкаДанныхПродажи = РезультатЗапроса[0].Выгрузить();
	ВыборкаДанныхОстатки = РезультатЗапроса[1].Выгрузить();

	ОбластьДанные.Параметры.ПитаниеПродажи = ВыборкаДанныхПродажи[0].СтоимостьОборот;
	ОбластьДанные.Параметры.ПитаниеСкидка = ВыборкаДанныхПродажи[0].СуммаСкидок;
	ОбластьДанные.Параметры.ПитаниеОстаток = ВыборкаДанныхОстатки[0].СтоимостьОстатков;
	
	ВСЕГОПродажи = ВСЕГОПродажи + ОбластьДанные.Параметры.ПитаниеПродажи;
	ВСЕГОСкидки = ВСЕГОСкидки + ОбластьДанные.Параметры.ПитаниеСкидка;
	ВСЕГООстатки = ВСЕГООстатки + ОбластьДанные.Параметры.ПитаниеОстаток;

	// Гигиена
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЕСТЬNULL(СУММА(ПродажиОборотыГигиена.СтоимостьОборот), 0) КАК СтоимостьОборот,
	               |	ЕСТЬNULL(СУММА(ПродажиОборотыГигиена.СтоимостьБезСкидокОборот), 0) КАК СтоимостьБезСкидокОборот,
	               |	ЕСТЬNULL(СУММА(ПродажиОборотыГигиена.СтоимостьБезСкидокОборот - ПродажиОборотыГигиена.СтоимостьОборот), 0) КАК СуммаСкидок
	               |ИЗ
	               |	РегистрНакопления.Продажи.Обороты(
	               |			&НачалоПериода,
	               |			&КонецПериода,
	               |			,
	               |			Склад В ИЕРАРХИИ (&Склад)
	               |				И Номенклатура.Ссылка В ИЕРАРХИИ (&Гигиена)) КАК ПродажиОборотыГигиена
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
				   |	ЕСТЬNULL(СУММА(ТоварыНаСкладахОстаткиИОбороты.КоличествоКонечныйОстаток),0) КАК КонечныйОстаток,
				   |	ЕСТЬNULL(СРЕДНЕЕ(ЦеныНоменклатурыСрезПоследних.Цена),0) КАК Цена,
                   |    ЕСТЬNULL(СУММА(ТоварыНаСкладахОстаткиИОбороты.КоличествоКонечныйОстаток * ЦеныНоменклатурыСрезПоследних.Цена), 0) КАК СтоимостьОстатков
	               |ИЗ
	               |	РегистрНакопления.ТоварыНаСкладах.ОстаткиИОбороты(
	               |			&НачалоПериода,
	               |			&КонецПериода,
	               |			,
	               |			,
	               |			Склад В ИЕРАРХИИ (&Склад)
	               |				И Номенклатура.Ссылка В ИЕРАРХИИ (&Гигиена)) КАК ТоварыНаСкладахОстаткиИОбороты
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДействующиеЦеныНоменклатуры.СрезПоследних КАК ЦеныНоменклатурыСрезПоследних
	               |		ПО ТоварыНаСкладахОстаткиИОбороты.Номенклатура = ЦеныНоменклатурыСрезПоследних.Номенклатура";
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	ВыборкаДанныхПродажи = РезультатЗапроса[0].Выгрузить();
	ВыборкаДанныхОстатки = РезультатЗапроса[1].Выгрузить();

	ОбластьДанные.Параметры.ГигиенаПродажи = ВыборкаДанныхПродажи[0].СтоимостьОборот;
	ОбластьДанные.Параметры.ГигиенаСкидка = ВыборкаДанныхПродажи[0].СуммаСкидок;
	ОбластьДанные.Параметры.ГигиенаОстаток = ВыборкаДанныхОстатки[0].СтоимостьОстатков;
	
	ВСЕГОПродажи = ВСЕГОПродажи + ОбластьДанные.Параметры.ГигиенаПродажи;
	ВСЕГОСкидки = ВСЕГОСкидки + ОбластьДанные.Параметры.ГигиенаСкидка;
	ВСЕГООстатки = ВСЕГООстатки + ОбластьДанные.Параметры.ГигиенаОстаток;
	
	// Одежда
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЕСТЬNULL(СУММА(ПродажиОборотыОдежда.СтоимостьОборот), 0) КАК СтоимостьОборот,
	               |	ЕСТЬNULL(СУММА(ПродажиОборотыОдежда.СтоимостьБезСкидокОборот), 0) КАК СтоимостьБезСкидокОборот,
	               |	ЕСТЬNULL(СУММА(ПродажиОборотыОдежда.СтоимостьБезСкидокОборот - ПродажиОборотыОдежда.СтоимостьОборот), 0) КАК СуммаСкидок
	               |ИЗ
	               |	РегистрНакопления.Продажи.Обороты(
	               |			&НачалоПериода,
	               |			&КонецПериода,
	               |			,
	               |			Склад В ИЕРАРХИИ (&Склад)
	               |				И Номенклатура.Ссылка В ИЕРАРХИИ (&Одежда)) КАК ПродажиОборотыОдежда
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
				   |	ЕСТЬNULL(СУММА(ТоварыНаСкладахОстаткиИОбороты.КоличествоКонечныйОстаток),0) КАК КонечныйОстаток,
				   |	ЕСТЬNULL(СРЕДНЕЕ(ЦеныНоменклатурыСрезПоследних.Цена),0) КАК Цена,
                   |    ЕСТЬNULL(СУММА(ТоварыНаСкладахОстаткиИОбороты.КоличествоКонечныйОстаток * ЦеныНоменклатурыСрезПоследних.Цена), 0) КАК СтоимостьОстатков
	               |ИЗ
	               |	РегистрНакопления.ТоварыНаСкладах.ОстаткиИОбороты(
	               |			&НачалоПериода,
	               |			&КонецПериода,
	               |			,
	               |			,
	               |			Склад В ИЕРАРХИИ (&Склад)
	               |				И Номенклатура.Ссылка В ИЕРАРХИИ (&Одежда)) КАК ТоварыНаСкладахОстаткиИОбороты
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДействующиеЦеныНоменклатуры.СрезПоследних КАК ЦеныНоменклатурыСрезПоследних
	               |		ПО ТоварыНаСкладахОстаткиИОбороты.Номенклатура = ЦеныНоменклатурыСрезПоследних.Номенклатура";
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	ВыборкаДанныхПродажи = РезультатЗапроса[0].Выгрузить();
	ВыборкаДанныхОстатки = РезультатЗапроса[1].Выгрузить();

	ОбластьДанные.Параметры.ОдеждаПродажи = ВыборкаДанныхПродажи[0].СтоимостьОборот;
	ОбластьДанные.Параметры.ОдеждаСкидка = ВыборкаДанныхПродажи[0].СуммаСкидок;
	ОбластьДанные.Параметры.ОдеждаОстаток = ВыборкаДанныхОстатки[0].СтоимостьОстатков;
	
	ВСЕГОПродажи = ВСЕГОПродажи + ОбластьДанные.Параметры.ОдеждаПродажи;
	ВСЕГОСкидки = ВСЕГОСкидки + ОбластьДанные.Параметры.ОдеждаСкидка;
	ВСЕГООстатки = ВСЕГООстатки + ОбластьДанные.Параметры.ОдеждаОстаток;
	
	// Обувь
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЕСТЬNULL(СУММА(ПродажиОборотыОбувь.СтоимостьОборот), 0) КАК СтоимостьОборот,
	               |	ЕСТЬNULL(СУММА(ПродажиОборотыОбувь.СтоимостьБезСкидокОборот), 0) КАК СтоимостьБезСкидокОборот,
	               |	ЕСТЬNULL(СУММА(ПродажиОборотыОбувь.СтоимостьБезСкидокОборот - ПродажиОборотыОбувь.СтоимостьОборот), 0) КАК СуммаСкидок
	               |ИЗ
	               |	РегистрНакопления.Продажи.Обороты(
	               |			&НачалоПериода,
	               |			&КонецПериода,
	               |			,
	               |			Склад В ИЕРАРХИИ (&Склад)
	               |				И Номенклатура.Ссылка В ИЕРАРХИИ (&Обувь)) КАК ПродажиОборотыОбувь
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
				   |	ЕСТЬNULL(СУММА(ТоварыНаСкладахОстаткиИОбороты.КоличествоКонечныйОстаток),0) КАК КонечныйОстаток,
				   |	ЕСТЬNULL(СРЕДНЕЕ(ЦеныНоменклатурыСрезПоследних.Цена),0) КАК Цена,
                   |    ЕСТЬNULL(СУММА(ТоварыНаСкладахОстаткиИОбороты.КоличествоКонечныйОстаток * ЦеныНоменклатурыСрезПоследних.Цена), 0) КАК СтоимостьОстатков
	               |ИЗ
	               |	РегистрНакопления.ТоварыНаСкладах.ОстаткиИОбороты(
	               |			&НачалоПериода,
	               |			&КонецПериода,
	               |			,
	               |			,
	               |			Склад В ИЕРАРХИИ (&Склад)
	               |				И Номенклатура.Ссылка В ИЕРАРХИИ (&Обувь)) КАК ТоварыНаСкладахОстаткиИОбороты
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДействующиеЦеныНоменклатуры.СрезПоследних КАК ЦеныНоменклатурыСрезПоследних
	               |		ПО ТоварыНаСкладахОстаткиИОбороты.Номенклатура = ЦеныНоменклатурыСрезПоследних.Номенклатура";
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	ВыборкаДанныхПродажи = РезультатЗапроса[0].Выгрузить();
	ВыборкаДанныхОстатки = РезультатЗапроса[1].Выгрузить();

	ОбластьДанные.Параметры.ОбувьПродажи = ВыборкаДанныхПродажи[0].СтоимостьОборот;
	ОбластьДанные.Параметры.ОбувьСкидка = ВыборкаДанныхПродажи[0].СуммаСкидок;
	ОбластьДанные.Параметры.ОбувьОстаток = ВыборкаДанныхОстатки[0].СтоимостьОстатков;
	
	ВСЕГОПродажи = ВСЕГОПродажи + ОбластьДанные.Параметры.ОбувьПродажи;
	ВСЕГОСкидки = ВСЕГОСкидки + ОбластьДанные.Параметры.ОбувьСкидка;
	ВСЕГООстатки = ВСЕГООстатки + ОбластьДанные.Параметры.ОбувьОстаток;
	
	// Игрушки
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЕСТЬNULL(СУММА(ПродажиОборотыИгрушки.СтоимостьОборот), 0) КАК СтоимостьОборот,
	               |	ЕСТЬNULL(СУММА(ПродажиОборотыИгрушки.СтоимостьБезСкидокОборот), 0) КАК СтоимостьБезСкидокОборот,
	               |	ЕСТЬNULL(СУММА(ПродажиОборотыИгрушки.СтоимостьБезСкидокОборот - ПродажиОборотыИгрушки.СтоимостьОборот), 0) КАК СуммаСкидок
	               |ИЗ
	               |	РегистрНакопления.Продажи.Обороты(
	               |			&НачалоПериода,
	               |			&КонецПериода,
	               |			,
	               |			Склад В ИЕРАРХИИ (&Склад)
	               |				И Номенклатура.Ссылка В ИЕРАРХИИ (&Игрушки)) КАК ПродажиОборотыИгрушки
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
				   |	ЕСТЬNULL(СУММА(ТоварыНаСкладахОстаткиИОбороты.КоличествоКонечныйОстаток),0) КАК КонечныйОстаток,
				   |	ЕСТЬNULL(СРЕДНЕЕ(ЦеныНоменклатурыСрезПоследних.Цена),0) КАК Цена,
                   |    ЕСТЬNULL(СУММА(ТоварыНаСкладахОстаткиИОбороты.КоличествоКонечныйОстаток * ЦеныНоменклатурыСрезПоследних.Цена), 0) КАК СтоимостьОстатков
	               |ИЗ
	               |	РегистрНакопления.ТоварыНаСкладах.ОстаткиИОбороты(
	               |			&НачалоПериода,
	               |			&КонецПериода,
	               |			,
	               |			,
	               |			Склад В ИЕРАРХИИ (&Склад)
	               |				И Номенклатура.Ссылка В ИЕРАРХИИ (&Игрушки)) КАК ТоварыНаСкладахОстаткиИОбороты
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДействующиеЦеныНоменклатуры.СрезПоследних КАК ЦеныНоменклатурыСрезПоследних
	               |		ПО ТоварыНаСкладахОстаткиИОбороты.Номенклатура = ЦеныНоменклатурыСрезПоследних.Номенклатура";
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	ВыборкаДанныхПродажи = РезультатЗапроса[0].Выгрузить();
	ВыборкаДанныхОстатки = РезультатЗапроса[1].Выгрузить();

	ОбластьДанные.Параметры.ИгрушкиПродажи = ВыборкаДанныхПродажи[0].СтоимостьОборот;
	ОбластьДанные.Параметры.ИгрушкиСкидка = ВыборкаДанныхПродажи[0].СуммаСкидок;
	ОбластьДанные.Параметры.ИгрушкиОстаток = ВыборкаДанныхОстатки[0].СтоимостьОстатков;
	
	ВСЕГОПродажи = ВСЕГОПродажи + ОбластьДанные.Параметры.ИгрушкиПродажи;
	ВСЕГОСкидки = ВСЕГОСкидки + ОбластьДанные.Параметры.ИгрушкиСкидка;
	ВСЕГООстатки = ВСЕГООстатки + ОбластьДанные.Параметры.ИгрушкиОстаток;
	
	// Услуги
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЕСТЬNULL(СУММА(ПродажиОборотыУслуги.СтоимостьОборот), 0) КАК СтоимостьОборот,
	               |	ЕСТЬNULL(СУММА(ПродажиОборотыУслуги.СтоимостьБезСкидокОборот), 0) КАК СтоимостьБезСкидокОборот,
	               |	ЕСТЬNULL(СУММА(ПродажиОборотыУслуги.СтоимостьБезСкидокОборот - ПродажиОборотыУслуги.СтоимостьОборот), 0) КАК СуммаСкидок
	               |ИЗ
	               |	РегистрНакопления.Продажи.Обороты(
	               |			&НачалоПериода,
	               |			&КонецПериода,
	               |			,
	               |			Склад В ИЕРАРХИИ (&Склад)
	               |				И Номенклатура.Ссылка В ИЕРАРХИИ (&Услуги)) КАК ПродажиОборотыУслуги
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
				   |	ЕСТЬNULL(СУММА(ТоварыНаСкладахОстаткиИОбороты.КоличествоКонечныйОстаток),0) КАК КонечныйОстаток,
				   |	ЕСТЬNULL(СРЕДНЕЕ(ЦеныНоменклатурыСрезПоследних.Цена),0) КАК Цена,
                   |    ЕСТЬNULL(СУММА(ТоварыНаСкладахОстаткиИОбороты.КоличествоКонечныйОстаток * ЦеныНоменклатурыСрезПоследних.Цена), 0) КАК СтоимостьОстатков
	               |ИЗ
	               |	РегистрНакопления.ТоварыНаСкладах.ОстаткиИОбороты(
	               |			&НачалоПериода,
	               |			&КонецПериода,
	               |			,
	               |			,
	               |			Склад В ИЕРАРХИИ (&Склад)
	               |				И Номенклатура.Ссылка В ИЕРАРХИИ (&Услуги)) КАК ТоварыНаСкладахОстаткиИОбороты
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДействующиеЦеныНоменклатуры.СрезПоследних КАК ЦеныНоменклатурыСрезПоследних
	               |		ПО ТоварыНаСкладахОстаткиИОбороты.Номенклатура = ЦеныНоменклатурыСрезПоследних.Номенклатура";
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	ВыборкаДанныхПродажи = РезультатЗапроса[0].Выгрузить();
	ВыборкаДанныхОстатки = РезультатЗапроса[1].Выгрузить();

	ОбластьДанные.Параметры.УслугиПродажи = ВыборкаДанныхПродажи[0].СтоимостьОборот;
	ОбластьДанные.Параметры.УслугиСкидка = ВыборкаДанныхПродажи[0].СуммаСкидок;
	ОбластьДанные.Параметры.УслугиОстаток = ВыборкаДанныхОстатки[0].СтоимостьОстатков;
	
	ВСЕГОПродажи = ВСЕГОПродажи + ОбластьДанные.Параметры.УслугиПродажи;
	ВСЕГОСкидки = ВСЕГОСкидки + ОбластьДанные.Параметры.УслугиСкидка;
	ВСЕГООстатки = ВСЕГООстатки + ОбластьДанные.Параметры.УслугиОстаток;
	
	// Мебель
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЕСТЬNULL(СУММА(ПродажиОборотыМебель.СтоимостьОборот), 0) КАК СтоимостьОборот,
	               |	ЕСТЬNULL(СУММА(ПродажиОборотыМебель.СтоимостьБезСкидокОборот), 0) КАК СтоимостьБезСкидокОборот,
	               |	ЕСТЬNULL(СУММА(ПродажиОборотыМебель.СтоимостьБезСкидокОборот - ПродажиОборотыМебель.СтоимостьОборот), 0) КАК СуммаСкидок
	               |ИЗ
	               |	РегистрНакопления.Продажи.Обороты(
	               |			&НачалоПериода,
	               |			&КонецПериода,
	               |			,
	               |			Склад В ИЕРАРХИИ (&Склад)
	               |				И Номенклатура.Ссылка В ИЕРАРХИИ (&Мебель)) КАК ПродажиОборотыМебель
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
				   |	ЕСТЬNULL(СУММА(ТоварыНаСкладахОстаткиИОбороты.КоличествоКонечныйОстаток),0) КАК КонечныйОстаток,
				   |	ЕСТЬNULL(СРЕДНЕЕ(ЦеныНоменклатурыСрезПоследних.Цена),0) КАК Цена,
                   |    ЕСТЬNULL(СУММА(ТоварыНаСкладахОстаткиИОбороты.КоличествоКонечныйОстаток * ЦеныНоменклатурыСрезПоследних.Цена), 0) КАК СтоимостьОстатков
	               |ИЗ
	               |	РегистрНакопления.ТоварыНаСкладах.ОстаткиИОбороты(
	               |			&НачалоПериода,
	               |			&КонецПериода,
	               |			,
	               |			,
	               |			Склад В ИЕРАРХИИ (&Склад)
	               |				И Номенклатура.Ссылка В ИЕРАРХИИ (&Мебель)) КАК ТоварыНаСкладахОстаткиИОбороты
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДействующиеЦеныНоменклатуры.СрезПоследних КАК ЦеныНоменклатурыСрезПоследних
	               |		ПО ТоварыНаСкладахОстаткиИОбороты.Номенклатура = ЦеныНоменклатурыСрезПоследних.Номенклатура";
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	ВыборкаДанныхПродажи = РезультатЗапроса[0].Выгрузить();
	ВыборкаДанныхОстатки = РезультатЗапроса[1].Выгрузить();

	ОбластьДанные.Параметры.МебельПродажи = ВыборкаДанныхПродажи[0].СтоимостьОборот;
	ОбластьДанные.Параметры.МебельСкидка = ВыборкаДанныхПродажи[0].СуммаСкидок;
	ОбластьДанные.Параметры.МебельОстаток = ВыборкаДанныхОстатки[0].СтоимостьОстатков;
	
	ВСЕГОПродажи = ВСЕГОПродажи + ОбластьДанные.Параметры.МебельПродажи;
	ВСЕГОСкидки = ВСЕГОСкидки + ОбластьДанные.Параметры.МебельСкидка;
	ВСЕГООстатки = ВСЕГООстатки + ОбластьДанные.Параметры.МебельОстаток;
	
	// Вибель 	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЕСТЬNULL(СУММА(ПродажиОборотыВибель.СтоимостьОборот), 0) КАК СтоимостьОборот,
	               |	ЕСТЬNULL(СУММА(ПродажиОборотыВибель.СтоимостьБезСкидокОборот), 0) КАК СтоимостьБезСкидокОборот,
	               |	ЕСТЬNULL(СУММА(ПродажиОборотыВибель.СтоимостьБезСкидокОборот - ПродажиОборотыВибель.СтоимостьОборот), 0) КАК СуммаСкидок
	               |ИЗ
	               |	РегистрНакопления.Продажи.Обороты(
	               |			&НачалоПериода,
	               |			&КонецПериода,
	               |			,
	               |			Склад В ИЕРАРХИИ (&Склад)
	               |				И Номенклатура.Ссылка В ИЕРАРХИИ (&Вибель)) КАК ПродажиОборотыВибель
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
				   |	ЕСТЬNULL(СУММА(ТоварыНаСкладахОстаткиИОбороты.КоличествоКонечныйОстаток),0) КАК КонечныйОстаток,
				   |	ЕСТЬNULL(СРЕДНЕЕ(ЦеныНоменклатурыСрезПоследних.Цена),0) КАК Цена,
                   |    ЕСТЬNULL(СУММА(ТоварыНаСкладахОстаткиИОбороты.КоличествоКонечныйОстаток * ЦеныНоменклатурыСрезПоследних.Цена), 0) КАК СтоимостьОстатков
	               |ИЗ
	               |	РегистрНакопления.ТоварыНаСкладах.ОстаткиИОбороты(
	               |			&НачалоПериода,
	               |			&КонецПериода,
	               |			,
	               |			,
	               |			Склад В ИЕРАРХИИ (&Склад)
	               |				И Номенклатура.Ссылка В ИЕРАРХИИ (&Вибель)) КАК ТоварыНаСкладахОстаткиИОбороты
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДействующиеЦеныНоменклатуры.СрезПоследних КАК ЦеныНоменклатурыСрезПоследних
	               |		ПО ТоварыНаСкладахОстаткиИОбороты.Номенклатура = ЦеныНоменклатурыСрезПоследних.Номенклатура";
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	ВыборкаДанныхПродажи = РезультатЗапроса[0].Выгрузить();
	ВыборкаДанныхОстатки = РезультатЗапроса[1].Выгрузить();

	ОбластьДанные.Параметры.ВибельПродажи 	= ВыборкаДанныхПродажи[0].СтоимостьОборот;
	ОбластьДанные.Параметры.ВибельСкидка 	= ВыборкаДанныхПродажи[0].СуммаСкидок;
	ОбластьДанные.Параметры.ВибельОстаток 	= ВыборкаДанныхОстатки[0].СтоимостьОстатков;
	
	ВСЕГОПродажи 	= ВСЕГОПродажи + ОбластьДанные.Параметры.ВибельПродажи;
	ВСЕГОСкидки 	= ВСЕГОСкидки + ОбластьДанные.Параметры.ВибельСкидка;
	ВСЕГООстатки 	= ВСЕГООстатки + ОбластьДанные.Параметры.ВибельОстаток;
	
	
	// область итогов
	ОбластьВсего = Макет.ПолучитьОбласть("ОбластьВсего");
	ОбластьВсего.Параметры.ВСЕГОПродажи = ВСЕГОПродажи;
	ОбластьВсего.Параметры.ВСЕГОСкидки = ВСЕГОСкидки;
	ОбластьВсего.Параметры.ВСЕГООстатки = ВСЕГООстатки;
	
	// выведение областей макета
	ТД.Вывести(ОбластьЗаголовок);
	ТД.Вывести(ОбластьДатаОтчета);
	ТД.Вывести(ОбластьДанные);
	ТД.Вывести(ОбластьВсего);
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьОтчет(Команда)
	СформироватьОтчетНаСервере();
КонецПроцедуры
